; domain
(define (domain miconic)
  (:requirements :strips)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(not-boarded ?person - passenger)
;; true if ?person has not boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(not-served ?person - passenger)
;; true if ?person is not at their destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding

(:action board
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (origin ?p ?f))
  :effect (boarded ?p))

(:action depart
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (destin ?p ?f)
		     (boarded ?p))
  :effect (and (not (boarded ?p))
	       (served ?p)))
;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
(define (problem mixed-f12-p16-u0-v0-d0-a0-n0-A0-B0-N0-F0)
   (:domain miconic)
   (:objects p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 
             p10 p11 p12 p13 p14 p15 - passenger
             f0 f1 f2 f3 f4 f5 f6 f7 f8 f9 
             f10 f11 - floor)


(:init
(above f0 f1)
(above f0 f2)
(above f0 f3)
(above f0 f4)
(above f0 f5)
(above f0 f6)
(above f0 f7)
(above f0 f8)
(above f0 f9)
(above f0 f10)
(above f0 f11)

(above f1 f2)
(above f1 f3)
(above f1 f4)
(above f1 f5)
(above f1 f6)
(above f1 f7)
(above f1 f8)
(above f1 f9)
(above f1 f10)
(above f1 f11)

(above f2 f3)
(above f2 f4)
(above f2 f5)
(above f2 f6)
(above f2 f7)
(above f2 f8)
(above f2 f9)
(above f2 f10)
(above f2 f11)

(above f3 f4)
(above f3 f5)
(above f3 f6)
(above f3 f7)
(above f3 f8)
(above f3 f9)
(above f3 f10)
(above f3 f11)

(above f4 f5)
(above f4 f6)
(above f4 f7)
(above f4 f8)
(above f4 f9)
(above f4 f10)
(above f4 f11)

(above f5 f6)
(above f5 f7)
(above f5 f8)
(above f5 f9)
(above f5 f10)
(above f5 f11)

(above f6 f7)
(above f6 f8)
(above f6 f9)
(above f6 f10)
(above f6 f11)

(above f7 f8)
(above f7 f9)
(above f7 f10)
(above f7 f11)

(above f8 f9)
(above f8 f10)
(above f8 f11)

(above f9 f10)
(above f9 f11)

(above f10 f11)



(origin p0 f10)
(destin p0 f1)

(origin p1 f11)
(destin p1 f1)

(origin p2 f8)
(destin p2 f7)

(origin p3 f6)
(destin p3 f7)

(origin p4 f5)
(destin p4 f3)

(origin p5 f11)
(destin p5 f9)

(origin p6 f10)
(destin p6 f2)

(origin p7 f6)
(destin p7 f9)

(origin p8 f8)
(destin p8 f0)

(origin p9 f1)
(destin p9 f6)

(origin p10 f2)
(destin p10 f4)

(origin p11 f11)
(destin p11 f6)

(origin p12 f6)
(destin p12 f4)

(origin p13 f10)
(destin p13 f1)

(origin p14 f5)
(destin p14 f11)

(origin p15 f11)
(destin p15 f8)






(lift-at f0)
)


(:goal


(and
(served p0)
(served p1)
(served p2)
(served p3)
(served p4)
(served p5)
(served p6)
(served p7)
(served p8)
(served p9)
(served p10)
(served p11)
(served p12)
(served p13)
(served p14)
(served p15)
))
)

; plan
1. (up f0 f5)
   deleted: (lift-at f0)
   added: (lift-at f5)
   goals met: 0 of 16
2. (board f5 p4)
   added: (boarded p4)
   goals met: 0 of 16
3. (board f5 p14)
   added: (boarded p14)
   goals met: 0 of 16
4. (up f5 f11)
   deleted: (lift-at f5)
   added: (lift-at f11)
   goals met: 0 of 16
5. (depart f11 p14)
   deleted: (boarded p14)
   added: (served p14)
   goals met: 1 of 16
6. (board f11 p5)
   added: (boarded p5)
   goals met: 1 of 16
7. (board f11 p15)
   added: (boarded p15)
   goals met: 1 of 16
8. (board f11 p11)
   added: (boarded p11)
   goals met: 1 of 16
9. (board f11 p1)
   added: (boarded p1)
   goals met: 1 of 16
10. (down f11 f10)
   deleted: (lift-at f11)
   added: (lift-at f10)
   goals met: 1 of 16
11. (board f10 p6)
   added: (boarded p6)
   goals met: 1 of 16
12. (board f10 p13)
   added: (boarded p13)
   goals met: 1 of 16
13. (board f10 p0)
   added: (boarded p0)
   goals met: 1 of 16
14. (down f10 f1)
   deleted: (lift-at f10)
   added: (lift-at f1)
   goals met: 1 of 16
15. (board f1 p9)
   added: (boarded p9)
   goals met: 1 of 16
16. (depart f1 p0)
   deleted: (boarded p0)
   added: (served p0)
   goals met: 2 of 16
17. (depart f1 p1)
   deleted: (boarded p1)
   added: (served p1)
   goals met: 3 of 16
18. (depart f1 p13)
   deleted: (boarded p13)
   added: (served p13)
   goals met: 4 of 16
19. (up f1 f2)
   deleted: (lift-at f1)
   added: (lift-at f2)
   goals met: 4 of 16
20. (board f2 p10)
   added: (boarded p10)
   goals met: 4 of 16
21. (depart f2 p6)
   deleted: (boarded p6)
   added: (served p6)
   goals met: 5 of 16
22. (up f2 f3)
   deleted: (lift-at f2)
   added: (lift-at f3)
   goals met: 5 of 16
23. (depart f3 p4)
   deleted: (boarded p4)
   added: (served p4)
   goals met: 6 of 16
24. (up f3 f6)
   deleted: (lift-at f3)
   added: (lift-at f6)
   goals met: 6 of 16
25. (board f6 p12)
   added: (boarded p12)
   goals met: 6 of 16
26. (board f6 p3)
   added: (boarded p3)
   goals met: 6 of 16
27. (board f6 p7)
   added: (boarded p7)
   goals met: 6 of 16
28. (depart f6 p11)
   deleted: (boarded p11)
   added: (served p11)
   goals met: 7 of 16
29. (depart f6 p9)
   deleted: (boarded p9)
   added: (served p9)
   goals met: 8 of 16
30. (down f6 f4)
   deleted: (lift-at f6)
   added: (lift-at f4)
   goals met: 8 of 16
31. (depart f4 p10)
   deleted: (boarded p10)
   added: (served p10)
   goals met: 9 of 16
32. (depart f4 p12)
   deleted: (boarded p12)
   added: (served p12)
   goals met: 10 of 16
33. (up f4 f8)
   deleted: (lift-at f4)
   added: (lift-at f8)
   goals met: 10 of 16
34. (board f8 p2)
   added: (boarded p2)
   goals met: 10 of 16
35. (board f8 p8)
   added: (boarded p8)
   goals met: 10 of 16
36. (depart f8 p15)
   deleted: (boarded p15)
   added: (served p15)
   goals met: 11 of 16
37. (down f8 f0)
   deleted: (lift-at f8)
   added: (lift-at f0)
   goals met: 11 of 16
38. (depart f0 p8)
   deleted: (boarded p8)
   added: (served p8)
   goals met: 12 of 16
39. (up f0 f7)
   deleted: (lift-at f0)
   added: (lift-at f7)
   goals met: 12 of 16
40. (depart f7 p2)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 13 of 16
41. (depart f7 p3)
   deleted: (boarded p3)
   added: (served p3)
   goals met: 14 of 16
42. (up f7 f9)
   deleted: (lift-at f7)
   added: (lift-at f9)
   goals met: 14 of 16
43. (depart f9 p5)
   deleted: (boarded p5)
   added: (served p5)
   goals met: 15 of 16
44. (depart f9 p7)
   deleted: (boarded p7)
   added: (served p7)
   goals met: 16 of 16
